Revit 2024 API
BaseExportOptions.HatchPatternsFileName Property
 Custom hatch patterns (pat) file name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string HatchPatternsFileName { get; set; }
Visual Basic
Public Property HatchPatternsFileName As String
	Get
	Set
Visual C++
public:
property String^ HatchPatternsFileName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace